QuantumLeaps/qpcpp-examples/arm-cm/dpp_ek-tm4c123gxl_mpu/qxk/bsp.cpp
__attribute__((aligned((1U << XTHREAD1_SIZE_POW2))))
std::uint8_t XThread1_sto[1U << XTHREAD1_SIZE_POW2];

static std::uint8_t * const XThread1_inst = &XThread1_sto[XTHREAD1_STACK_SIZE];

#ifdef QF_MEM_ISOLATE
static MPU_Region const MPU_XThread1[3] = {
    { reinterpret_cast<std::uint32_t>(XThread1_sto) + 0x10U,//---- region #0
      ((XTHREAD1_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos) // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { GPIOF_AHB_BASE + 0x11U,                  //---- region #1
      ((9U - 1U) << MPU_RASR_SIZE_Pos)                // 2^9=512B size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (0U << MPU_RASR_C_Pos)                       // C=0
       + (1U << MPU_RASR_B_Pos)                       // B=1
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};
#endif

// XThread2 thread............................................................
constexpr std::uint32_t XTHREAD2_SIZE_POW2  {10U};  // XThread2 instance + stack
constexpr std::uint32_t XTHREAD2_STACK_SIZE {880U}; // XThread2 stack size

__attribute__((aligned((1U << XTHREAD2_SIZE_POW2))))
std::uint8_t XThread2_sto[1U << XTHREAD2_SIZE_POW2];

static std::uint8_t * const XThread2_inst = &XThread2_sto[XTHREAD2_STACK_SIZE];

#ifdef QF_MEM_ISOLATE
static MPU_Region const MPU_XThread2[3] = {
    { reinterpret_cast<std::uint32_t>(XThread2_sto) + 0x10U,//---- region #0
      ((XTHREAD2_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos) // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { GPIOF_AHB_BASE + 0x11U,                  //---- region #1
      ((9U - 1U) << MPU_RASR_SIZE_Pos)                // 2^9=512B size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (0U << MPU_RASR_C_Pos)                       // C=0
       + (1U << MPU_RASR_B_Pos)                       // B=1
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};
#endif

} // unnamed namespace

// Idle thread ............................................................
#ifdef QF_MEM_ISOLATE

#ifdef Q_SPY
// Idle thread owns QS-RX, so it needs access to its data...

// size of QS_rxPriv_, as power-of-2
#define QS_RX_PRIV_SIZE_POW2 ((uint32_t)7U)
namespace QP {
namespace QS {
__attribute__((aligned((1U << QS_RX_PRIV_SIZE_POW2))))
RxAttr rxPriv_;

static_assert(sizeof(rxPriv_) <= (1U << QS_RX_PRIV_SIZE_POW2),
              "Insufficient storage for QS-RX data");
} // namespace QS
} // namespace QP

namespace { // unnamed namespace

// size of QS-RX buffer, as power-of-2
#define QS_RX_BUF_SIZE_POW2 ((uint32_t)7U)
__attribute__((aligned((1U << QS_RX_BUF_SIZE_POW2))))
std::uint8_t QS_rxBuf[1U << QS_RX_BUF_SIZE_POW2];

static MPU_Region const MPU_Idle[3] = {
    { reinterpret_cast<std::uint32_t>(&QP::QS::rxPriv_) + 0x10U, //---- region #0
      ((QS_RX_PRIV_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { reinterpret_cast<std::uint32_t>(&QS_rxBuf) + 0x11U, //---- region #1
      ((QS_RX_BUF_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};

} // unnamed namespace

#else // Q_SPY not defined

namespace { // unnamed namespace

static MPU_Region const MPU_Idle[3] = {
    { 0U + 0x10U,                              //---- region #0
      0U },
    { 0U + 0x11U,                              //---- region #1
      0U },
    { 0U + 0x12U,                              //---- region #2
      0U },
};

} // unnamed namespace

#endif // Q_SPY not defined
#endif // QF_MEM_ISOLATE

// Shared Event-pools.........................................................
namespace { // unnamed namespace

constexpr std::uint32_t EPOOLS_SIZE_POW2 {8U};

__attribute__((aligned((1U << EPOOLS_SIZE_POW2))))
static struct EPools {
    QF_MPOOL_EL(APP::TableEvt) smlPool[2*APP::N_PHILO];
    // ... other pools
} EPools_sto;
static_assert(sizeof(EPools_sto) <= (1U << EPOOLS_SIZE_POW2),
              "Insufficient storage for Event Pools");

} // unnamed namespace


//============================================================================
#ifdef QF_MEM_ISOLATE

